
#3. Вывести на экран числа от -N до N

#n = int(input('N = '))
#for number in range(-n, n+1):
#    print(number)

#8. Сообщить в какой четверти координатной плоскости 
#или на какой оси находится точка с координатами Х и У 

# x = int(input('X = '))
# y = int(input('Y = '))
# if x>0 and y>0:
#     print("I четверть")
# if x<0 and y>0:
#     print("II четверть")
# if x<0 and y<0:
#     print("III четверть")
# if x>0 and y<0:
#     print("IV четверть")
#*****************************
#9. Указав номер четверти прямоугольной системы координат, 
#показать допустимые значения координат для точек этой четверти

# a = int(input('Введите номер четверти в виде 1, 2, 3 или 4 = '))
# if a == 1:
#     print("x > 0 and y > 0")
# if a == 2:
#     print("x < 0 and y > 0")
# if a == 3:
#     print("x < 0 and y < 0")
# if a == 4:
#     print("x > 0 and y < 0")

#************************************
# 10.  Найти расстояние между двумя точками пространства 
# sqrt (x_2 - x_1)^2 + (y_2 - y_1)^2
# import math   math.sqrt()

# x1 = int(input('X1 = '))
# y1 = int(input('Y1 = '))
# x2 = int(input('X2 = '))
# y2 = int(input('Y2 = '))
# print(((x2 - x1)**2 + (y2 - y1)**2)**(1/2))

# #**********************************
# #1. По двум заданным числам проверить является ли одно квадратом второго
# a = 16
# b = 4
# if a**2 == b:
#     print("число b является квадратом числа a")
# if b**2 == a:
#     print("число a является квадратом числа b")

# #*****************************************

# with open('c:\Users\User\Documents\Python\Python\Seminari_dz/s_1_dz_3.py''a') as file:
#     file.write('1')